# ------------------------------------------------------------
# Dotfiles packages (pacman)
# ------------------------------------------------------------

# Core / build / scripting
git
stow
base-devel
curl
jq

# Shell
zsh

# ------------------------------------------------------------
# Hyprland (compositor + session tools)
# ------------------------------------------------------------
hyprland
hypridle
hyprlock

# Bar / notifications / terminal
waybar
swaync
kitty

# ------------------------------------------------------------
# Audio (PipeWire)
# ------------------------------------------------------------
pipewire
pipewire-pulse
wireplumber
libnotify
pavucontrol
playerctl

# ------------------------------------------------------------
# Power
# ------------------------------------------------------------
power-profiles-daemon
python-gobject
gobject-introspection

# ------------------------------------------------------------
# Network
# ------------------------------------------------------------
networkmanager
nm-connection-editor

# ------------------------------------------------------------
# Clipboard / screenshots
# ------------------------------------------------------------
wl-clipboard
grim
slurp
satty

# ------------------------------------------------------------
# File manager
# ------------------------------------------------------------
thunar

# ------------------------------------------------------------
# Dev / editor / monitoring
# ------------------------------------------------------------
neovim
btop
fastfetch

# ------------------------------------------------------------
# Search / launcher helpers
# ------------------------------------------------------------
fd
ripgrep
openbsd-netcat
xdg-utils
desktop-file-utils
shared-mime-info

# ------------------------------------------------------------
# Theming / fonts
# ------------------------------------------------------------
python-pywal
ttf-hack-nerd
